// Задача необязательная 1: на входе целое или вещественное число, надо удалить вторую цифру слева этого числа.

// 145 -> 15
// 1 -> нет
// 567,123 -> 57,123

System.Console.Write("Введите любое число:  ");
var num = Console.ReadLine();
var[] array = num;
System.Console.WriteLine(array);
